app/controllers/students_controller.rb

SELECT `students`.* FROM `students`
---
  def index
    @students = Student.all

SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def show
    @student = Student.find(params[:id])

SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def edit
    @student = Student.find(params[:id])

INSERT INTO `students` (`address`, `age`, `created_at`, `doj`, `email`, `firstname`, `lastname`, `updated_at`) VALUES ('Unknown', 0, '2013-12-02 07:04:41', NULL, 'Unknown', 'None', 'None', '2013-12-02 07:04:41')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save

SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `address` = 'alskjf, slkjdf3 455', `age` = 24, `doj` = '2000-12-12', `email` = 'skdjf@gmail.com', `firstname` = 'big', `lastname` = 'ram', `updated_at` = '2013-12-03 10:08:36' WHERE `students`.`id` = 9
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 1
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy